In [2]:
import pandas as pd

In [4]:
titanic = pd.read_csv("data/titanic.csv")

In [6]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [8]:
titanic["Age"].mean()

29.471443066516347

In [10]:
titanic[["Age", "Fare"]].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [12]:
titanic[["Age", "Fare"]].describe()

              Age       Fare
count  887.000000  887.00000
mean    29.471443   32.30542
std     14.121908   49.78204
min      0.420000    0.00000
25%     20.250000    7.92500
50%     28.000000   14.45420
75%     38.000000   31.13750
max     80.000000  512.32920

In [14]:
titanic.agg(
    {
        "Age": ["min", "max", "median", "skew"],
        "Fare": ["min", "max", "median", "mean"],
    }
)

              Age       Fare
min      0.420000    0.00000
max     80.000000  512.32920
median  28.000000   14.45420
skew     0.447189        NaN
mean          NaN   32.30542

In [16]:
titanic[["Sex", "Age"]].groupby("Sex").mean()

              Age
Sex
female  27.719745
male    30.431361

In [18]:
titanic.groupby("Sex").mean(numeric_only=True)

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
Sex,,,,,,
female,0.742038,2.159236,27.719745,0.694268,0.649682,44.479818
male,0.190227,2.385689,30.431361,0.432810,0.237347,25.633935

In [20]:
titanic.groupby("Sex")["Age"].mean()

Sex
female    27.719745
male      30.431361
Name: Age, dtype: float64

In [22]:
titanic.groupby(["Sex", "Pclass"])["Fare"].mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.695466
Name: Fare, dtype: float64

In [24]:
titanic["Pclass"].value_counts()

3    487
1    216
2    184
Name: Pclass, dtype: int64

In [26]:
titanic.groupby("Pclass")["Pclass"].count()

Pclass
1    216
2    184
3    487
Name: Pclass, dtype: int64